[
    "Are you a magician? Because you just cast a spell on me.",
    "Do you like raisins? How do you feel about a date?",
    "I wish I were cross-eyed so I can see you twice.",
    "You’re my favorite YouTuber. I wanna smash your like button and subscribe for the rest of my life.",
    "I’m not a photographer, but I can picture me and you together.",
    "Are you a bank loan? Well, you’ve certainly got my interest.",
    "If you were a triangle, you’d be acute one!",
    "Your hand looks heavy, let me hold it for you.",
    "I think you are suffering from a lack of Vitamin Me.",
    "Do you like Harry Potter? Because I adumbledore you.",
    "Was your dad a boxer? Because damn, you’re a knockout!",
    "I was wondering if you had an extra heart. Mine was just stolen.",
    "Can I have your picture so I can show Santa what I want for Christmas?",
    "Excuse me, do you have a band-aid? Cause I scraped my knee falling for you.",
    "They say Disneyland is the happiest place on earth. Well apparently, no one has ever been standing next to you.",
    "Are you an alien? Because you just abducted my heart.",
    "I seem to have lost my phone number. Can I have yours?",
    "I’m lost. Can you give me directions to your heart?",
    "Are you a parking ticket? Cause you’ve got fine written all over you.",
    "Are you wi-fi? Cause I’m totally feeling a connection.",
    "If I had a nickel for every time I saw someone as beautiful as you, I’d have five cents.",
    "I’d like to take you to the movies, but they don’t let you bring in your own snacks.",
    "Know what’s on the menu? Me-N-U.",
    "You and I are like nachos with jalapeños. I’m super cheesy, you’re super hot, and we belong together.",
    "I hope you know CPR, because you are taking my breath away!",
    "I’m in the mood for pizza. A pizza you, that is!",
    "I’ve got 1-ply, I’ve got 2-ply, but all I really want is your re-ply.",
    "You must be a campfire. Because you’re super hot and I want s’more.",
    "I’m glad I remembered to bring my library card. ‘Cause I am totally checking you out!",
    "If you were a vegetable, you would be a cute-cumber!",
    "Do you have a map? Because I’m getting lost in your eyes.",
    "This may be cheesy, but I think you’re grate.",
    "Do you wanna grab a coffee? Because I like you a latte!",
    "Do you have a pencil? Cause I want to erase your past and write our future.",
    "Are you my Appendix? Because I have a funny feeling in my stomach that makes me feel like I should take you out.",
    "Are you a fruit, because Honeydew you know how fine you look right now?",
    "Do you drink Pepsi? Because you’re so-da-licious!",
    "I’m no organ donor but I’d be happy to give you my heart.",
    "Do you like Nintendo? Because Wii would look good together.",
    "If you were a flower you’d be a damnnn-delion!",
    "If you were ground coffee, you’d be Espresso cause you’re so fine.",
    "I was blinded by your beauty; I’m going to need your name and phone number for insurance purposes.",
    "Did you invent the airplane? Because you seem Wright for me.",
    "Did the sun come out or did you just smile at me?",
    "Are you religious? Because you’re the answer to all my prayers."
]


